Revit 2026 API

# DWGImportOptionsSetLineWeights Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLineWeights(
	IList<int> lineWeight
)
```
```vb
Public Sub SetLineWeights (
	lineWeight As IList(Of Integer)
)
```
```cpp
public:
void SetLineWeights(
	IList<int>^ lineWeight
)
```
```fsharp
member SetLineWeights :
        lineWeight : IList<int> -> unit
```

#### Parameters

lineWeight IListInt32

#### Reference

DWGImportOptions Class

Autodesk.Revit.DB Namespace